{"ID":36902,"Author":{"Name":"prashere","ID":0,"FullName":"","Gravatar":"6a77946c4ab2b5fd7c7869816e1b8278"},"Title":"GCC: Compiling C Programs to produce 32 and 64 bit Binaries","Description":"\u003cdiv class=\"content\"\u003e\u003cp\u003e\u003cstrong\u003eGCC\u003c/strong\u003e expanded as \u003cstrong\u003eG\u003c/strong\u003enu \u003cstrong\u003eC\u003c/strong\u003eompiler \u003cstrong\u003eC\u003c/strong\u003eollection is a \u003ca href=\"http://www.gnu.org/philosophy/free-sw.html\"\u003eFree Software\u003c/a\u003e Multi language Compiler collection that follows the \u003cstrong\u003eANSI Standards\u003c/strong\u003e.\u003c/p\u003e\n\n\u003cp\u003eHere in this Terminal Cast, I show you how to compile a simple hello-world program and produce binary for both 32 and 64 bit machine. My computer is an 64 bit machine, so I can produce 64 bit as well as 32 bit binary, but if your machine is 32 bit machine, you can only produce binary for 32 bit architecture.\u003c/p\u003e\n\n\u003cp\u003eAlso please note that I have installed gcc-multilib in order to generate binary for multiple architecture. If you have just gcc, you cannot use the -m flag that I have used above.\u003c/p\u003e\n\n\u003chr/\u003e\n\n\u003cp\u003e\u003ccode\u003e./output32\u003c/code\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e. (dot) in the above shell command denotes the current folder.\u003c/li\u003e\n\u003cli\u003e/ (slash) denotes the path of this current folder / directory.\u003c/li\u003e\n\u003cli\u003eoutput32 is the name of the binary executable.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003chr/\u003e\n\n\u003cp\u003eI prefer and use \u003ccode\u003evim\u003c/code\u003e as my text editor. You can use any text editor of your choice.\u003cbr/\u003e\nSome common text editors that comes by default in GNU/Linux distributions,\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003egedit (Graphical Text Editor similar to Notepad and has more features like syntax highlighting, etc.,)\u003c/li\u003e\n\u003cli\u003enano\u003c/li\u003e\n\u003cli\u003evi (vim is vi improved)\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e","Time":"2016-02-20T18:40:08Z","Tags":["Linux","bash","xterm-256color"]}